---
kind: property
id: P:Autodesk.Revit.DB.Visual.Stone.StoneBumpAmount
source: html/5c02aea5-6258-4801-e7ba-4865e3eae2d9.htm
---
# Autodesk.Revit.DB.Visual.Stone.StoneBumpAmount Property

The property labeled "Amount" from the "Stone" schema.

## Syntax (C#)
```csharp
public static string StoneBumpAmount { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".